app/controllers/site_studies_controller.rb

  def index
    @site_studies = SiteStudy.all
---
SELECT "site_studies".* FROM "site_studies"

    def set_site_study
      @site_study = SiteStudy.find(params[:id])
---
SELECT  "studies".* FROM "studies" WHERE "studies"."id" = ? LIMIT 1  [["id", 1]]