app/controllers/sites_controller.rb

    def set_site
      @site = Site.find(params[:id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", 1]]