app/controllers/studies_controller.rb

  def index
    @studies = Study.all
---
SELECT "studies".* FROM "studies"

    def set_study
      @study = Study.find(params[:id])
---
SELECT  "studies".* FROM "studies" WHERE "studies"."id" = ? LIMIT 1  [["id", 1]]