app/controllers/user_sites_controller.rb

  def index
    @user_sites = UserSite.all
---
SELECT "user_sites".* FROM "user_sites"

    def set_user_site
      @user_site = UserSite.find(params[:id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", 1]]