app/controllers/user_studies_controller.rb

  def index
    @user_studies = UserStudy.all
---
SELECT "user_studies".* FROM "user_studies"

  def create
    @user_study = UserStudy.new(user_study_params)

    respond_to do |format|
      if @user_study.save
---
INSERT INTO "user_studies" ("User_id", "Study_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["User_id", 2], ["Study_id", 1], ["created_at", "2016-03-07 07:42:54.647620"], ["updated_at", "2016-03-07 07:42:54.647620"]]

    def set_user_study
      @user_study = UserStudy.find(params[:id])
---
SELECT  "user_studies".* FROM "user_studies" WHERE "user_studies"."id" = ? LIMIT 1  [["id", 1]]